---
kind: property
id: P:Autodesk.Revit.DB.Face.Reference
source: html/f3d5d2fe-96bf-8528-4628-78d8d5e6705f.htm
---
# Autodesk.Revit.DB.Face.Reference Property

Returns a stable reference to the face.

## Syntax (C#)
```csharp
public Reference Reference { get; }
```